src/projects/configuration/251029_GKSTCPLK-1831/src/InformationRegisters/гкс_ПриемкаТранспортаБезВходногоКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПриемкаТранспортаБезВходногоКонтроля</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроизводственныеСутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/projects/configuration/251029_GKSTCPLK-1831/src/InformationRegisters/гкс_ПриемкаТранспортаБезВходногоКонтроля/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Возвращает структуру записи
//
// Возвращаемое значение:
//  Структура - структура записи.
//
Функция СтруктураЗаписи() Экспорт
    
    СтруктураЗаписи = Новый Структура;
	
	СтруктураЗаписи.Вставить("ДокументРегистрации");
	СтруктураЗаписи.Вставить("ПроизводственныеСутки");
	СтруктураЗаписи.Вставить("Поставщик");
	СтруктураЗаписи.Вставить("Номенклатура");
	СтруктураЗаписи.Вставить("ТранспортноеСредство");


    Возврат СтруктураЗаписи;
    
КонецФункции

// Зарегистрировать приемку транспорта без входного контроля.
// 
// Параметры:
//  ДанныеРегистрации Данные регистрации
Процедура ЗарегистрироватьПриемкуТранспортаБезВходногоКонтроля(ДанныеРегистрации) Экспорт

	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ДокументРегистрации.Установить(ДанныеРегистрации.ДокументРегистрации);
	
	НоваяЗапись = Набор.Добавить();
	НоваяЗапись.ДокументРегистрации = ДанныеРегистрации.ДокументРегистрации;
	НоваяЗапись.ПроизводственныеСутки = ДанныеРегистрации.ПроизводственныеСутки;
	НоваяЗапись.Поставщик = ДанныеРегистрации.Поставщик;
	НоваяЗапись.Номенклатура = ДанныеРегистрации.Номенклатура;
	НоваяЗапись.ТранспортноеСредство = ДанныеРегистрации.ТранспортноеСредство;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
